---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.SaveDocument
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.SaveDocument

Save the current document to avoid losing more if something serious occurs.